Description: Downloads the latest version of Studio3T
Identifier: com.github.moofit-recipes.pkg.Studio3TUniversal
ParentRecipe: com.github.moofit-recipes.download.Studio3TUniversal
MinimumVersion: '2.3'
Input:
    NAME: Studio 3T
    URL: https://studio3t.com/download/
    BUNDLE_ID: com.install4j.8357-7994-5030-9105.837

Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/Intel"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/downloads/%NAME%-Intel.dmg"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      source_path: "%found_filename%/%NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%BUNDLE_ID%.Intel"
        options: purge_ds_store
        pkgname: "%NAME%-Intel-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/Intel"
        version: "%version%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/Silicon"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/downloads/%NAME%-Silicon.dmg"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      source_path: "%found_filename%/%NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%BUNDLE_ID%.Silicon"
        options: purge_ds_store
        pkgname: "%NAME%-Silicon-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/Silicon"
        version: "%version%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        scripts: "0755"
        root: "0755"
        root/private: "0755"
        root/private/tmp: "0777"
      pkgroot: "%RECIPE_CACHE_DIR%/Universal"

  - Processor: FileMover
    Arguments:
      overwrite: false
      source: "%RECIPE_CACHE_DIR%/%NAME%-Intel-%version%.pkg"
      target: "%RECIPE_CACHE_DIR%/Universal/root/private/tmp/%NAME%-Intel-%version%.pkg"

  - Processor: FileMover
    Arguments:
      overwrite: false
      source: "%RECIPE_CACHE_DIR%/%NAME%-Silicon-%version%.pkg"
      target: "%RECIPE_CACHE_DIR%/Universal/root/private/tmp/%NAME%-Silicon-%version%.pkg"

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/Universal/scripts/postinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/zsh

        # Set variables
        declare -r INTEL="$3/private/tmp/%NAME%-Intel-%version%.pkg"
        declare -r APPLE_SILICON="$3/private/tmp/%NAME%-Silicon-%version%.pkg"

        # Determine architecture
        ARCH=$(/usr/bin/arch)

        # Install corresponding package
        if [[ "${ARCH}" == i386 ]]
        then
            /usr/sbin/installer -pkg "${INTEL}" -target "$3"
            EXIT_CODE=$?
        else
            /usr/sbin/installer -pkg "${APPLE_SILICON}" -target "$3"
            EXIT_CODE=$?
        fi

        echo "Cleaning up..."
        /bin/rm -rf "${INTEL}" "${APPLE_SILICON}"

        # Check exit code and bail if the package didn't install correctly
        if [[ "${EXIT_CODE}" -ne 0 ]]
        then
            echo "Something went wrong during package installation. Please check install.log and try again. Bailing..."
            exit 1
        fi

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: "%BUNDLE_ID%"
        options: purge_ds_store
        pkgname: "%NAME%Universal-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/universal/root"
        scripts: "%RECIPE_CACHE_DIR%/universal/scripts"
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/universal"
        - "%RECIPE_CACHE_DIR%/Intel"
        - "%RECIPE_CACHE_DIR%/Silicon"