Description: Recipe description
Identifier: com.github.moofit-recipes.pkg.Glyphs3
Input:
  NAME: Glyphs 3
MinimumVersion: '2.3'
ParentRecipe: com.github.dataJAR-recipes.download.Glyphs 3
Process:
- Processor: PlistReader
  Arguments:
    info_path: "%RECIPE_CACHE_DIR%/%NAME%/Applications/Glyphs 3.app/Contents/Info.plist"
    plist_keys: 
      CFBundleIdentifier: bundleid
- Processor: PkgRootCreator
  Arguments:
    pkgroot: "%RECIPE_CACHE_DIR%/package/%NAME%"
    pkgdirs: 
      Applications: "0775"
- Processor: Copier
  Arguments:
    source_path: "%RECIPE_CACHE_DIR%/%NAME%/Applications/Glyphs 3.app"
    destination_path: "%pkgroot%/Applications/Glyphs 3.app"
- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
        - group: admin
          path: Applications
          user: root
      id: "%bundleid%"
      options: purge_ds_store
      pkgname: "%NAME%-%version%"
      pkgdir: "%RECIPE_CACHE_DIR%"
