<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.1 (https://github.com/homebysix/recipe-robot)
	Original copy from https://github.com/autopkg/ygini-recipes</string>
	<key>Description</key>
	<string>Downloads the latest version of Elgato Video Capture.</string>
	<key>Identifier</key>
	<string>com.github.amsysuk.amsys-recipes.download.ElgatoVideoCapture</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Elgato Video Capture</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
	    <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>http://updates.elgato.com/autoupdate/videoCapture.rss</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://updates.elgato.com/autoupdate/videoCapture.rss</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>re_pattern</key>
				<string>Elgato Video Capture (\d\.\d\.\d)</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
