<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.moofit-recipes.download.OutWitHub</string>
	<key>Description</key>
	<string>Downloads the latest version of OutWit Hub</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OutWit Hub</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.outwit.com/downloads/release/outwit-hub.en-US.mac64.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/OutWit Hub.app</string>
				<key>requirement</key>
                    <string>identifier "com.outwit.outwit-hub" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Q6W5GV5VY4</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
