<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.amsysuk-recipes.pkg.AutoPkg</string>
    <key>Description</key>
    <string>Downloads the most recent version of AutoPkg using
om.github.rtrouton.download.AutoPkg-Release and moves the pkg.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AutoPkg</string>
    </dict>
    <key>ParentRecipe</key>
    <string>om.github.rtrouton.download.AutoPkg-Release</string>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
