Description: This recipe downloads the latest version of Keeper Password Manager and creates a package
Identifier: com.github.moofit-recipes.pkg.KeeperPasswordManager
ParentRecipe: com.github.moofit-recipes.download.KeeperPasswordManager

Input:
  NAME: "Keeper Password Manager"

MinimumVersion: "2.3"

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/Keeper Password Manager.app"
      source_path: "%pathname%/Keeper Password Manager.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            mode: "0775"
            path: Applications
            user: root
        id: "%bundleid%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        pkgroot: "%pkgroot%"
        version: "%version%"
