Description: This recipe downloads the latest version of Keeper Password Manager
Identifier: com.github.moofit-recipes.download.KeeperPasswordManager

Input:
  NAME: "Keeper Password Manager"

MinimumVersion: "2.3"

Process:
  - Processor: URLDownloader
    Arguments:
      url: https://keepersecurity.com/desktop_electron/Darwin/KeeperSetup.dmg

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Keeper Password Manager.app"
      requirement: 'identifier "com.keepersecurity.passwordmanager" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "234QNB7GCA"'
