<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.amsysuk-recipes.download.Avenue</string>
    <key>Description</key>
    <string>Downloads the latest version of Resolume Avenue</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Avenue</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href="(https://resolume\.com/download/file\?file=Resolume_Avenue_[\d_]+_rev_\d+_Installer\.dmg)"</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://resolume.com/download/?file=latest_avenue</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>iframe src="//(dd5sgwxv3xok\.cloudfront\.net/Resolume_Avenue_[\d_]+_rev_\d+_Installer\.dmg)"</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Resolume (Z9Y8N6Q4L8)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/Resolume Avenue Installer.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
