<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.amsysuk.amsys-recipes.download.Avenue</string>
	<key>Description</key>
	<string>Downloads the latest version of Resolume Avenue</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Avenue</string>
		<key>CHECK_PAGE_URL</key>
		<string>https://resolume.com/download?file=latest_avenue</string>
		<key>DOWNLOAD_PAGE_URL</key>
		<string>https://d19j6z4lvv1vde.cloudfront.net</string>
		<key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%CHECK_PAGE_URL%</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>re_pattern</key>
				<string>resolume.*?\.dmg</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_PAGE_URL%/%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
   		 <key>Processor</key>
  		  <string>CodeSignatureVerifier</string>
  		  <key>Arguments</key>
  		  <dict>
  		      <key>input_path</key>
     		   <string>%pathname%/Resolume Avenue * Installer.pkg</string>
     		   <key>expected_authority_names</key>
     		   <array>
     		       <string>Developer ID Installer: Resolume (Z9Y8N6Q4L8)</string>
     		       <string>Developer ID Certification Authority</string>
    		    	<string>Apple Root CA</string>
     		   </array>
  		  </dict>
		</dict>
	</array>
</dict>
</plist>
