Description: Downloads the latest version of Pitch and package it
Identifier: com.github.moofit-recipes.pkg.Pitch
MinimumVersion: "2.3"
ParentRecipe: com.github.dataJAR-recipes.download.Pitch

Input:
  NAME: Pitch

Process:
  - Processor: AppPkgCreator
