Description: Downloads the latest version of Pitch.
Identifier: com.github.moofit-recipes.download.Pitch
MinimumVersion: "2.3"

Input:
  NAME: Pitch
  URL: https://desktop.pitch.com/mac/Pitch.dmg

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%URL%"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Pitch.app"
      requirement: identifier "io.pitch.pitch-macos" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = KUCN8NUU6Z

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/%NAME%.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundleid
