<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Syncplicity disk image.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.download.syncplicity</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Syncplicity</string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.syncplicity.com/mac/Syncplicity.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Syncplicity, Inc. (9MAQ4GMJ3D)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
