<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Syncplicity disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.pkg.syncplicity</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Syncplicity</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.download.syncplicity</string>
    <key>Process</key>
    <array>
          <dict>
              <key>Processor</key>
              <string>Copier</string>
              <key>Arguments</key>
              <dict>
                  <key>source_path</key>
                  <string>%RECIPE_CACHE_DIR%/downloads/Syncplicity.dmg/Install Syncplicity*.pkg</string>
                  <key>destination_path</key>
                  <string>%RECIPE_CACHE_DIR%/Syncplicity.pkg</string>
              </dict>
          </dict>
          <dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack/</string>
          <key>flat_pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/Syncplicity.pkg</string>
          <key>purge_destination</key>
          <string>true</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/</string>
          <key>pkg_payload_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack/Syncplicity.Component.pkg/Payload</string>
          <key>purge_destination</key>
          <string>true</string>
        </dict>
      </dict>
          <dict>
              <key>Processor</key>
              <string>Versioner</string>
              <key>Arguments</key>
              <dict>
                  <key>input_plist_path</key>
                  <string>%RECIPE_CACHE_DIR%/payload/Applications/Syncplicity.app/Contents/Info.plist</string>
                  <key>plist_version_key</key>
                  <string>CFBundleVersion</string>
              </dict>
          </dict>
          <dict>
              <key>Processor</key>
              <string>PkgCopier</string>
              <key>Arguments</key>
              <dict>
                  <key>source_pkg</key>
                  <string>%RECIPE_CACHE_DIR%/Syncplicity.pkg</string>
                  <key>pkg_path</key>
                  <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
              </dict>
          </dict>
    </array>
</dict>
</plist>
