<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Kindle Gen from Amazon (outs a Zip file)</string>
	<key>Identifier</key>
	<string>com.github.amsysuk.amsys-recipes.download.KindleGen</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KindleGen</string>
		<key>CHECK_PAGE_URL</key>
		<string>https://www.amazon.com/gp/feature.html?docId=1000765211</string>
		<key>DOWNLOAD_PAGE_URL</key>
		<string>http://kindlegen.s3.amazonaws.com</string>		
		<key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%CHECK_PAGE_URL%</string>
				<key>result_output_var_name</key>
				<string>file</string>
				<key>re_pattern</key>
				<string>KindleGen_Mac_i386_v.*\.zip</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_PAGE_URL%/%file%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
