Identifier: com.github.moofit-recipes.download.WebexUniversal
Description: Downloads both Intel and Silicon versions of Webex to be packaged into a universal installer 
Input:
  RECIPE_APP_NAME: Webex
  INTEL_URL: 'https://binaries.webex.com/webex-macos-intel/Webex.dmg'
  SILICON_URL: 'https://binaries.webex.com/webex-macos-apple-silicon/Webex.dmg'

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%INTEL_URL%"
      download_dir: "%RECIPE_CACHE_DIR%/Downloads"
      filename: "%RECIPE_APP_NAME%-Intel.dmg"

  - Processor: URLDownloader
    Arguments:
      url: "%SILICON_URL%"
      download_dir: "%RECIPE_CACHE_DIR%/Downloads"
      filename: "%RECIPE_APP_NAME%-Silicon.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Webex.app"
      requirement: identifier "Cisco-Systems.Spark" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DE8Y96K9QP

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/Webex.app/Contents/Info.plist"
      plist_keys:
        CFBundleIdentifier: bundle_id
        CFBundleShortVersionString: bundle_version
        CFBundleName: bundle_name
