Description: Recipe description
Identifier: com.github.moofit-recipes.pkg.Reaper
ParentRecipe: com.github.moofit-recipes.download.Reaper
Input:
  RECIPE_APP_NAME: REAPER
  URL: https://www.reaper.fm

MinimumVersion: '2.3'
Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/Downloads/%bundle_name%.dmg"
  
  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%bundle_name%.app"
      source_path: "%found_filename%/%bundle_name%.app"

  - Processor: com.github.homebysix.VersionSplitter/VersionSplitter
    Arguments:
      version: "%bundle_version%"
      split_on: _

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundle_identifier%"
        options: purge_ds_store
        pkgname: "%bundle_name%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"