<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Meshmixer and names according to current version</string>
	<key>Identifier</key>
	<string>com.github.amsysuk.amsys-recipes.pkg.Meshmixer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Meshmixer</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;https://s3\.amazonaws\.com/meshmixer\.release/Autodesk_Meshmixer_v[A-Za-z0-9_.]+_macOS\.pkg)</string>
		<key>SEARCH_URL</key>
		<string>http://www.meshmixer.com/download.html</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.amsysuk.amsys-recipes.download.Meshmixer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded</string>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Meshmixer.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded/com.meshmixer.meshmixer09.pkg/Payload</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Meshmixer.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
