<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest verison of Mudbox from a local file.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.pkg.Mudbox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mudbox</string>
        <key>FILE_NAME_SEARCH_TERM</key>
        <string></string>
        <key>VERSION</key>
        <string></string>
        <key>PRODUCT_KEY</key>
        <string></string>
        <key>EULA_LOCALE</key>
        <string></string>
        <key>SERIAL_NUMBER</key>
        <string></string>
        <key>LIC_SERVER</key>
        <string></string>
        <key>PATH_TO_DMG</key>
        <string></string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.download.Mudbox</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>pkgdirs</key>
                <dict>
                    <key>root/private/tmp</key>
                    <string>0777</string>
                    <key>scripts</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%/*.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/root/private/tmp/%NAME%.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_DIR%/scripts/AutodeskPostInstall</string>
                <key>destination_path</key>
                <string>%RECIPE_DIR%/scripts/AutodeskPostInstallTmp</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AutodeskPostInstallSetup</string>
            <key>Arguments</key>
            <dict>
                <key>PRODUCT_VERSION</key>
                <string>%VERSION%.0.0.F</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_DIR%/scripts/AutodeskPostInstallTmp</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/payload/scripts/postinstall</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg.novaksam-recipes.Processors/FileChmodEditor</string>
            <key>Arguments</key>
            <dict>
                <key>modifier</key>
                <string>755</string>
                <key>pathname</key>
                <string>%RECIPE_CACHE_DIR%/payload/scripts/postinstall</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%VERSION%</string>
                <key>pkg_request</key>
                <dict>
                    <key>id</key>
                    <string>com.autodesk.Mudbox%VERSION%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/payload/root</string>
                    <key>scripts</key>
                    <string>%RECIPE_CACHE_DIR%/payload/scripts</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
