<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of SketchBook Pro from a local file.</string>
	<key>Identifier</key>
	<string>com.github.moofit-recipes.download.SketchBookPro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SketchBook Pro</string>
        <key>FILE_NAME_SEARCH_TERM</key>
        <string></string>
		<key>PATH_TO_DMG</key>
		<string></string>
        <key>VERSION_YEAR</key>
        <string></string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe has been deprecated as future versions of this application are available from the Mac App Store (https://apps.apple.com/gb/app/sketchbook-pro/id1570472288?mt=12)</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%PATH_TO_DMG%/*%FILE_NAME_SEARCH_TERM%*.dmg</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%/*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Autodesk (XXKJ396S2Y)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
