<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest verison of SketchBook Pro from a local file.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.pkg.SketchBookPro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SketchBook Pro</string>
        <key>FILE_NAME_SEARCH_TERM</key>
        <string></string>
        <key>VERSION_YEAR</key>
        <string></string>
        <key>PRODUCT_KEY</key>
        <string></string>
        <key>EULA_LOCALE</key>
        <string></string>
        <key>SERIAL_NUMBER</key>
        <string></string>
        <key>LIC_SERVER</key>
        <string></string>
        <key>PATH_TO_DMG</key>
        <string></string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.download.SketchBookPro</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe has been deprecated as future versions of this application are available from the Mac App Store (https://apps.apple.com/gb/app/sketchbook-pro/id1570472288?mt=12)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>pkgdirs</key>
                <dict>
                    <key>root/private/tmp</key>
                    <string>0777</string>
                    <key>scripts</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%/*.pkg</string>
                <key>destination_path</key>
                <string>%pkgroot%/root/private/tmp/%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Comment</key>
            <string>Make postinstall script for use in the package</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/scripts/postinstall</string>
                <key>file_content</key>
                <string>#!/bin/sh

##### Define Functions

writelog ()
{
    # Write to system log
    /usr/bin/logger -is -t "${LOG_PROCESS}" "${1}"
}

cleanup ()
{
    writelog "Cleaning up..."
    rm -rf "/tmp/%NAME%.pkg"
}

##### Run script

# Install %NAME%
writelog "Installing %NAME% %VER%..."

if [ -e "/tmp/%NAME%.pkg" ]
then
    writelog "%NAME% %VER% package installer found."
    /usr/sbin/installer -pkg "/tmp/%NAME%.pkg" -target /
elif [ -e "/tmp/%NAME%.app" ]
then
    EXIT_CODE=0
    writelog "Installing all pkgs within %NAME%.app...."

    # It's worthwhile noting that the following lines are a workaround to two issues with Autodesk's non-native PKG 
    # installers; they don't work when a user isn't logged into the Mac, and they don't work when bundled inside a pkg 
    # with a postinstall script. Therefore, we need to manually install all pkgs present inside the Setup.app bundle,
    # with the first pkg always being the AdskLicensing-*.pkg. 
    #
    # Le sigh.

    for LICENSING_PKG in $(/usr/bin/find "/tmp/%NAME%.app" -name *Licensing*.pkg)
    do
        IFS=$'\n'
        writelog "Installing ${LICENSING_PKG}..."
        /usr/sbin/installer -pkg "${LICENSING_PKG}" -target /
        if [ $? -ne 0 ]
        then
            writelog "Could not install ${LICENSING_PKG}. Please inspect the Autodesk setup logs for more info."
            EXIT_CODE=1
        else
            writelog "${LICENSING_PKG} install successful."
        fi
        unset IFS
    done
    for COMPONENT_PKG in $(/usr/bin/find "/tmp/%NAME%.app" -name *.pkg ! -name *Licensing*.pkg)
    do
        IFS=$'\n'
        writelog "Installing ${COMPONENT_PKG}..."
        /usr/sbin/installer -pkg "${COMPONENT_PKG}" -target /
        if [ $? -ne 0 ]
        then
            writelog "Could not install ${COMPONENT_PKG}. Please inspect the Autodesk setup logs for more info."
            EXIT_CODE=1
        else
            writelog "${COMPONENT_PKG} install successful."
        fi
        unset IFS
    done
else
    writelog "No %NAME% %VER% installer binary or package was found. Bailing..."
    exit 1
fi

if [ ${EXIT_CODE} -ne 0 ]
then
    writelog "Could not install %NAME% %VER%. Please inspect the Autodesk setup logs for more info. Bailing..."
    exit 1
else
    writelog "%NAME% %VER% install successful."
fi

# Fix permissions on the adlm folder to allow for licensing
/bin/chmod -R 755 "/Library/Application Support/Autodesk/Adlm"

# activate application
writelog "Licensing %NAME% %VER%..."
if ! "/Library/Application Support/Autodesk/AdskLicensing/Current/helper/AdskLicensingInstHelper" \
    register \
    --cf "/Library/Application Support/Autodesk/Adlm/.config/ProductInformation.pit" \
    --prod_key %PK% \
    --prod_ver %PV% \
    --eula_locale %EL% \
    --serial_number %SN% \
    --lic_method %LM% --lic_servers '@'%LS%
then
    writelog "Could not license %NAME% %VER%. Please inspect the Autodesk setup logs for more info. Bailing..."
    cleanup
    exit 1
else
    writelog "%NAME% %VER% licensing successful."
    cleanup
fi</string>
                <key>file_mode</key>
                <string>0755</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AutodeskPostInstallSetup</string>
            <key>Arguments</key>
            <dict>
                <key>PRODUCT_VERSION</key>
                <string>%VERSION_YEAR%.0.0.F</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%VERSION_YEAR%</string>
                    <key>id</key>
                    <string>com.autodesk.SketchBookPro%VERSION_YEAR%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/payload/root</string>
                    <key>scripts</key>
                    <string>%RECIPE_CACHE_DIR%/payload/scripts</string>
                    <key>version</key>
                    <string>%VERSION_YEAR%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
