<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest Simple Apps zip file, extracts the "Simple Client" app and bundles into a pkg.</string>
        <key>Identifier</key>
        <string>com.github.moofit-recipes.pkg.simpleclient</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Simple Client</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.moofit-recipes.download.simpleapps</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Syphon Simple Apps/Simple Client.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "info.v002.syphon.Simple-Client" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = SWFQ99ZP9J)</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Syphon Simple Apps/Simple Client.app</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleVersion</key>
                        <string>version</string>
                        <key>CFBundleIdentifier</key>
                        <string>BUNDLE_ID</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileMover</string>
                <key>Arguments</key>
                <dict>
                    <key>source</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Syphon Simple Apps/Simple Client.app</string>
                    <key>target</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Simple Client.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                        <key>id</key>
                        <string>%BUNDLE_ID%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>Applications</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>admin</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/unpack</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
