<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest Simple Apps zip file. Contains both Simple Client and Simple Server</string>
        <key>Identifier</key>
        <string>com.github.moofit-recipes.download.simpleapps</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Simple Apps</string>
            <key>INCLUDE_PRERELEASES</key>
            <string></string>
            <key>GITHUB_REPO</key>
            <string>Syphon/Simple</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>^Syphon.*.zip$</string>
                    <key>github_repo</key>
                    <string>%GITHUB_REPO%</string>
                    <key>include_prereleases</key>
                    <string>%INCLUDE_PRERELEASES%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Syphon Simple Apps/Simple Client.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "info.v002.syphon.Simple-Client" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = SWFQ99ZP9J)</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Syphon Simple Apps/Simple Server.app</string>
                    <key>requirement</key>
                    <string>anchor apple generic and identifier "info.v002.syphon.Simple-Server" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = SWFQ99ZP9J)</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
