<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Komodo Edit.
    </string>
    <key>Identifier</key>
    <string>com.github.moofit.pkg.KomodoEdit</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KomodoEdit</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.activestate.com/komodo-ide/downloads/edit</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://.*?Komodo-Edit.*?dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
    </array>
</dict>
</plist>
