<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Eclipse and makes a pkg of it.</string>
    <key>Identifier</key>
    <string>com.github.amsysuk.amsys-recipes.pkg.Eclipse</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Eclipse</string>
        <key>SELECTION</key>
        <string>Eclipse IDE for Java Developers</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.8</string>
    <key>ParentRecipe</key>
    <string>com.github.sheagcraig.download.Eclipse</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%pkgroot%/Applications</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pkgroot%/Applications/Eclipse.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>PKG_ID</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Applications/Eclipse.app/Contents/MacOS/eclipse</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                            <key>mode</key>
                            <string>755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.amsysuk.amsys-recipes.Rsync/Rsync</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>destination_path</key>
                <string>/Users/Shared/Packaging/Live</string>
                <key>rsync_arguments</key>
                <string>-a</string>
            </dict>
        </dict>        
    </array>
</dict>
</plist>
