<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>com.github.moofit-recipes.pkg.BoxDrive</string>
        <key>Description</key>
        <string>Uses parent download recipe
	com.github.dataJAR-recipes.download.boxdrive to download the latest Box
    Drive installer pkg. This recipe renames the package to "Box Drive-$version"
	</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Box Drive</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.1</string>
        <key>ParentRecipe</key>
        <string>com.github.dataJAR-recipes.download.boxdrive</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/</string>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>purge_destination</key>
                    <string>true</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/BoxDesktopDrive.pkg/Payload</string>
                    <key>purge_destination</key>
                    <string>true</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/Box.app/Contents/Info.plist</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/payload</string>
                        <string>%RECIPE_CACHE_DIR%/unpack</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
