Description: Recipe description
Identifier: com.github.moofit-recipes.download.FinalDraft12
Input:
  NAME: Final Draft 12
  URL: https://www.finaldraft.com/support/install-final-draft/install-final-draft-12-macintosh/

MinimumVersion: '2.3'
Process:

  - Processor: URLTextSearcher
    Arguments:
      url: "%URL%"
      re_pattern: "(\/downloads\/finaldraft[0-9]+Mac.zip)"

  - Processor: URLDownloader
    Arguments:
      url: https://www.finaldraft.com%match%
      filename: "%NAME%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: true
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%/Final Draft 12.dmg/Final Draft 12.app"
      requirement: anchor apple generic and identifier "com.finaldraft.finaldraft.v12" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7XUZ8R5736")
  
  - Processor: EndOfCheckPhase

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/%NAME%/Final Draft 12.dmg/Final Draft 12.app"
      plist_keys:
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundleid