Description: Recipe description
Identifier: com.github.moofit-recipes.pkg.HudlSportscode
Input:
  NAME: Hudl Sportscode
  URL: https://www.hudl.com/downloads/elite

MinimumVersion: '2.3'
ParentRecipe: com.github.moofit-recipes.download.HudlSportscode
Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: EndOfCheckPhase

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/%NAME%/**/%NAME%.app"

  - Processor: Copier
    Arguments:
      source_path: "%found_filename%"
      destination_path: "%pkgroot%/Applications/%NAME%.app"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%found_filename%/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString
      version: "%version%"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"