<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Sound Studio and generates a package</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.pkg.SoundStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Sound Studio 4</string>
        <key>DOWNLOAD_URL</key>
        <string>https://s3.amazonaws.com/felttip.ss-downloads/</string>
        <key>SEARCH_URL</key>
        <string>https://felttip.com/ss/downloads.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;dmg&gt;sound_studio_.*\.zip)</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.SoundStudio</string>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Sound Studio 4.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleVersion</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/package/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Sound Studio 4.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
