<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of BlueJeans desktop app and create a package.</string>
	<key>Identifier</key>
	<string>com.github.moofit-recipes.pkg.bluejeans</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.bluejeansnet.Blue</string>
		<key>NAME</key>
		<string>BlueJeans</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.moofit-recipes.download.bluejeans</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/BlueJeans.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
