Description: Downloads the latest version of FCS Express.
Identifier: com.github.moofit-recipes.download.FCSExpress7Research
MinimumVersion: "2.3"

Input:
  NAME: FCS Express 7 Research
  URL: https://denovosoftware.com/download-landing/FCSExpress7CytometryInstallation-Mac.dmg

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%URL%"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/FCS Express 7 Research.app"
      requirement: anchor apple generic and identifier "com.denovosoftware.fcsexpress7researchbeta" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2VXG79YY2X")

  - Processor: EndOfCheckPhase

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/%NAME%.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundleid