Description: Downloads the latest version of FCS Express and package it
Identifier: com.github.moofit-recipes.pkg.FCSExpress7Research
MinimumVersion: "2.3"
ParentRecipe: com.github.moofit-recipes.download.FCSExpress7Research

Input:
  NAME: FCS Express 7 Research
  URL: https://denovosoftware.com/download-landing/FCSExpress7CytometryInstallation-Mac.dmg

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg"
  
  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      source_path: "%found_filename%/%NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"