<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Mimecast from it's website</string>
        <key>Identifier</key>
        <string>com.github.amsysuk.amsys-recipes.pkg.Mimecast</string>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Mimecast</string>
            <key>URL</key>
            <string>https://community.mimecast.com/community/knowledge-base/application-downloads/pages/mimecast-for-mac</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%CHECK_PAGE_URL%</string>
                    <key>result_output_var_name</key>
                    <string>url</string>
                    <key>re_pattern</key>
                    <string>Install_Mimecast_v*.pkg</string>
                    <key>re_flags</key>
                    <array>
                        <string>IGNORECASE</string>
                    </array>
                    <key>request_headers</key>
                    <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%URL%</string>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/expanded</string>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/expanded/%filename%/Payload</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/OneDrive.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
