<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Transfers the package from the pre-downloaded DMG.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.pkg.JamfConnectSyncLaunchAgent</string>
    <key>Input</key>
    <dict>
        <key>APP_FILENAME</key>
        <string>Jamf Connect Sync LaunchAgent</string>
        <key>BUNDLE_ID</key>
        <string>com.jamf.connect.sync.launchagent</string>
        <key>NAME</key>
        <string>JamfConnectSyncLaunchAgent</string>
        <key>version</key>
        <string>1.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.yohan460-recipes.download.JamfConnect</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/* Sync/Launch Agent/*ProRemoval.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Orchard &amp; Grove Inc. (VRPY9KHGX6)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/* Sync/Launch Agent/*ProRemoval.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
