Description: Downloads the latest version of SketchUp 2024
Identifier: com.github.moofit-recipes.download.SketchUp Pro 2024
Input:
  NAME: SketchUp 2024
  URL: https://help.sketchup.com/en/downloading-sketchup

Based on: com.github.dataJAR-recipes.download.SketchUp Pro 2022 EN

MinimumVersion: '1.0.0'
Process:

  - Processor: URLTextSearcher
    Arguments:
      url: "%URL%"
      re_pattern: https://download\.sketchup\.com/SketchUp-2024-.*\.dmg
      request_headers:  
        Referer: "https://www.google.com/"
        Upgrade-Insecure-Requests: "1"
        User-Agent: "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/109.0.0.0 Safari/537.36"
        sec-ch-ua: "\"Not_A Brand\";v=\"99\", \"Google Chrome\";v=\"109\", \"Chromium\";v=\"109\""
        sec-ch-ua-mobile: "?0"
        sec-ch-ua-platform: "\"Mac OS X\""

  - Processor: URLDownloader
    Arguments:
      url: "%match%"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/SketchUp 2024/LayOut.app"
      requirement: identifier "com.sketchup.LayOut.2024" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J8PVMCY7KL

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/SketchUp 2024/SketchUp.app"
      requirement: identifier "com.sketchup.SketchUp.2024" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J8PVMCY7KL

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/SketchUp 2024/Style Builder.app"
      requirement: identifier "com.sketchup.StyleBuilder.2024" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J8PVMCY7KL