Description: Downloads the current version of RODE Connect.
Identifier: com.github.moofit-recipes.download.RODEConnect
MinimumVersion: "2.3"

Input:
  NAME: RODE Connect

Process:

  - Processor: URLDownloader
    Arguments:
      url: "https://update.rode.com/connect/RODE_Connect_MACOS.zip"
      filename: "%NAME%.zip"

  - Processor: EndOfCheckPhase

  - Arguments:
      archive_format: zip
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: True
    Comment: Unzipping for code signature verification. Path must be deleted afterwards to prevent unzipping over existing version.
    Processor: Unarchiver

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unzip/*.pkg"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%found_filename%"
      expected_authority_names: 
       - "Developer ID Installer: FREEDMAN ELECTRONICS PTY LTD (Z9T72PWTJA)"
       - Developer ID Certification Authority
       - Apple Root CA
