Description: Downloads the current version of RODE Connect.
Identifier: com.github.moofit-recipes.download.RODEConnect
MinimumVersion: "2.3"

Input:
  NAME: RODE Connect
  URL: https://rode.com/en/software/rodeconnect#module_17

Process:

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: https.+?RODE Connect macOS.+?zip
      url: "%URL%"

  - Processor: com.github.homebysix.FindAndReplace/FindAndReplace
    Arguments:
      find: " "
      input_string: "%match%"
      replace: "%20"

  - Processor: URLDownloader
    Arguments:
      url: "%output_string%"
      filename: "%NAME%.zip"

  - Processor: EndOfCheckPhase

  - Arguments:
      archive_format: zip
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: True
    Comment: Unzipping for code signature verification. Path must be deleted afterwards to prevent unzipping over existing version.
    Processor: Unarchiver

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unzip/*/RODE Connect.pkg"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      expected_authority_names: 
       - "Developer ID Installer: FREEDMAN ELECTRONICS PTY LTD (Z9T72PWTJA)"
       - Developer ID Certification Authority
       - Apple Root CA

