Identifier: com.github.moofit-recipes.download.WebStormUniversal
Input:
  AMD64_URL: https://download.jetbrains.com/product?code=WS&latest&distribution=mac
  ARM64_URL: https://download.jetbrains.com/product?code=WS&latest&distribution=macM1
  BUNDLE_ID: com.jetbrains.WebStorm
  NAME: WebStorm
Process:

  - Processor: URLDownloader
    Arguments:
      url:   "%AMD64_URL%"
      filename: "%NAME%-amd64.dmg"

  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/WebStorm.app"
      requirement: identifier "com.jetbrains.WebStorm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"
      
  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/WebStorm.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: URLDownloader
    Arguments:
      url:   "%ARM64_URL%"
      filename: "%NAME%-arm64.dmg"

  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/WebStorm.app"
      requirement: identifier "com.jetbrains.WebStorm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/WebStorm.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString