<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.pkg.Xcode</string>
    <key>Description</key>
    <string>Creates an installer package from a supplied .xip file downloaded using Facebook's "xcode.downloader" 
        recipe, and extracted using their "xcode.extract" recipe from their AutoPkg repo 
        "com.github.facebook.Recipes-for-AutoPkg".
        
        Please see https://github.com/facebook/Recipes-for-AutoPkg for usage</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
		<string>Xcode</string>
		<key>APPLE_ID</key>
		<string></string>
		<key>PASSWORD_FILE</key>
		<string></string>
		<key>BETA</key>
		<string></string>
		<key>PATTERN</key>
		<string>((?!.*beta).*\/Xcode_.*\/Xcode.*.xip)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>ParentRecipe</key>
    <string>com.facebook.autopkg.xcode.extract</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_unpack/Xcode.app</string>
                <key>target</key>
                <string>%pkgroot%/Applications/Xcode.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                            <key>mode</key>
                            <string>0775</string>
                        </dict>
                    </array>
                    <key>id</key>
                    <string>com.apple.dt.Xcode</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_unpack</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
