<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the current built package of Desktoppr.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.download.Desktoppr</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Desktoppr</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Comment</key>
            <string>Get the latest release package.</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>scriptingosx/desktoppr</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Comment</key>
            <string>Download latest Desktoppr package.</string>
            <key>Arguments</key>
            <dict />
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Armin Briegel (JME5BW3F3R)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
