<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest TouchDesigner dmg file.</string>
        <key>Identifier</key>
        <string>com.github.moofit-recipes.download.touchdesigner</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>TouchDesigner</string>
            <key>DOWNLOAD_PAGE</key>
            <string>https://derivative.ca/download</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>  
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_PAGE%</string>
                    <key>re_pattern</key>
                    <string>https://download.derivative.ca/TouchDesigner.[0-9]+.[a-zA-Z0-9]+.intel.dmg</string>
                    <key>result_output_var_name</key>
                    <string>DOWNLOAD_URL</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%NAME%.app</string>
                    <key>requirement</key>
                    <string>identifier "ca.derivative.TouchDesigner" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Z7MPGSMXH2</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>