<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest TouchDesigner dmg file and bundles the app into a pkg.</string>
        <key>Identifier</key>
        <string>com.github.moofit-recipes.pkg.touchdesigner</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>TouchDesigner</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.moofit-recipes.download.touchdesigner</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%NAME%.app</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleVersion</key>
                        <string>version</string>
                        <key>CFBundleIdentifier</key>
                        <string>BUNDLE_ID</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%NAME%.app</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/TouchDesigner.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                        <key>id</key>
                        <string>%BUNDLE_ID%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>Applications</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>admin</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
