<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.download.MIDIControlCenter</string>
    <key>Description</key>
    <string>Downloads the latest version of Arturia MIDI Control Center.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MIDI Control Center</string>
        <key>CHECK_PAGE_URL</key>
        <string>https://www.arturia.com/api/resources?slugs=mccu&amp;types=soft</string>
        <key>CHECK_PAGE_PATTERN</key>
        <string>"(https://dl\.arturia\.net/products/mccu/soft/MIDI_Control_Center[\d_]+\.pkg)"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%CHECK_PAGE_URL%</string>
                <key>re_pattern</key>
                <string>%CHECK_PAGE_PATTERN%</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Arturia (T53ZHSF36C)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
