Description: Recipe description
Identifier: com.github.moofit-recipes.pkg.Zwift-moofit
Input:
  NAME: Zwift
  URL: https://zwift.com/download/mac

  MinimumVersion: '2.3'
ParentRecipe: com.github.moofit-recipes.download.Zwift-moofit
Process:

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/unpack/"
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/%NAME%.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      purge_destination: True

  - Processor: EndOfCheckPhase

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/payload/%NAME%.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: EndOfCheckPhase

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
