Description: Downloads both intel and silicon versions of GIMP to be packaged
Identifier: com.github.moofit-recipes.download.gimp
Input:
  INTEL: x86_64
  SILICON: arm64

Notes: Code requirement will need to be renewed on each new version as it contains the version number

Process:

  - Processor: URLTextSearcher
    Arguments:
      url: "https://download.gimp.org/gimp/"
      re_pattern: '(?s).*(v3\.[0-9]+)/'
      result_output_var_name: gimp_series

  - Processor: URLTextSearcher
    Arguments:
      url: "https://download.gimp.org/gimp/%gimp_series%/macos/"
      re_pattern: '0\.0_LATEST-IS-([0-9]+\.[0-9]+\.[0-9]+(?:-[0-9]+)?)'
      result_output_var_name: version

  - Processor: URLDownloader
    Arguments:
      url: "https://download.gimp.org/gimp/%gimp_series%/macos/gimp-%version%-%INTEL%.dmg"
      filename: "gimp-%version%-%INTEL%.dmg"
      download_dir: "%RECIPE_CACHE_DIR%/downloads"

  - Processor: URLDownloader
    Arguments:
      url: "https://download.gimp.org/gimp/%gimp_series%/macos/gimp-%version%-%SILICON%.dmg"
      filename: "gimp-%version%-%SILICON%.dmg"
      download_dir: "%RECIPE_CACHE_DIR%/downloads"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/GIMP.app"
      requirement: identifier "org.gimp.gimp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = T25BQ8HSJF

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/GIMP.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: bundle_version
        CFBundleIdentifier: bundle_identifier
        CFBundleName: bundle_name