<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Storyboarder from Wonderunit.</string>
    <key>Identifier</key>
    <string>com.github.amsysuk-recipes.download.Storyboarder</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Storyboarder</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Comment</key>
            <string>Get the latest release package.</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>wonderunit/storyboarder</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Comment</key>
            <string>Download latest Storyboarder package.</string>
            <key>Arguments</key>
            <dict />
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Storyboarder.app</string>
                <key>requirements</key>
                <string>identifier "com.wonderunit.storyboarder" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UVHK77PMAM</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
