<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.amsysuk.amsys-recipes.download.Isadora</string>
	<key>Description</key>
	<string>Downloads the latest version of Isadora</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Isadora</string>
		<key>CHECK_PAGE_URL</key>
		<string>https://troikatronix.com/get-it/</string>
		<key>DOWNLOAD_PAGE_URL</key>
		<string>https://troikatronix.com/files</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%CHECK_PAGE_URL%</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>re_pattern</key>
				<string>isadoramac-.*-usb\.dmg</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_PAGE_URL%/%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
