<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Isadora</string>
        <key>Identifier</key>
        <string>com.github.amsysuk.amsys-recipes.pkg.Isadora</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Isadora</string>
            <key>CHECK_PAGE_URL</key>
            <string>https://troikatronix.com/get-it/</string>
            <key>DOWNLOAD_PAGE_URL</key>
            <string>https://troikatronix.com/files</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.amsysuk.amsys-recipes.download.Isadora</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%pathname%/Isadora USB Key Installer.pkg/Contents/Info.plist</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleIdentifier</key>
                        <string>bundleid</string>
                        <key>CFBundleShortVersionString</key>
                        <string>version</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>PlistReader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%/Isadora USB Key Installer.pkg</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
