<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Isadora</string>
        <key>Identifier</key>
        <string>com.github.amsysuk.amsys-recipes.pkg.Isadora</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Isadora</string>
            <key>CHECK_PAGE_URL</key>
            <string>https://troikatronix.com/get-it/</string>
            <key>DOWNLOAD_PAGE_URL</key>
            <string>https://troikatronix.com/files</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.amsysuk.amsys-recipes.download.Isadora</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/expanded</string>
                    <key>flat_pkg_path</key>
                    <string>%pathname%/Isadora USB Key Installer.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/expanded/Resolume_Avenue.pkg/Payload</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/Info.plist</string>
                    <key>source_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Applications/Resolume Avenue */Avenue.app/Contents/Info.plist</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleVersion</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/expanded/Resolume_Avenue.pkg/Scripts/postinstall</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FlatPkgPacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>source_flatpkg_dir</key>
                    <string>%RECIPE_CACHE_DIR%/expanded/Resolume_Avenue.pkg</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
