Description:  both INTEL_ARCH and SILICON_ARCH versions of WordPress and builds them into a package
Identifier: com.github.moofit-recipes.pkg.WordPress
ParentRecipe: com.github.moofit-recipes.download.WordPress
Input:
  RECIPE_APP_NAME: WordPress
  URL: https://apps.wordpress.com
  INTEL_ARCH: Intel
  SILICON_ARCH: Silicon

Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%INTEL_ARCH%"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/downloads/%RECIPE_APP_NAME%_%INTEL_ARCH%.dmg"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%RECIPE_APP_NAME%.app"
      source_path: "%found_filename%/%RECIPE_APP_NAME%.com.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            mode: "0775"
            path: Applications
            user: root
          - group: staff
            mode: "0775"
            path: "Applications/%RECIPE_APP_NAME%.app"
            user: root
        id: "%bundle_identifier%.%INTEL_ARCH%"
        options: purge_ds_store
        pkgname: "%RECIPE_APP_NAME%_%INTEL_ARCH%-%bundle_version%"
        pkgroot: "%RECIPE_CACHE_DIR%/%INTEL_ARCH%"
        version: "%bundle_version%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%SILICON_ARCH%"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/downloads/%RECIPE_APP_NAME%_%SILICON_ARCH%.dmg"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%RECIPE_APP_NAME%.app"
      source_path: "%found_filename%/%RECIPE_APP_NAME%.com.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            mode: "0775"
            path: Applications
            user: root
          - group: staff
            mode: "0775"
            path: "Applications/%RECIPE_APP_NAME%.app"
            user: root
        id: "%bundle_identifier%.%SILICON_ARCH%"
        options: purge_ds_store
        pkgname: "%RECIPE_APP_NAME%_%SILICON_ARCH%-%bundle_version%"
        pkgroot: "%RECIPE_CACHE_DIR%/%SILICON_ARCH%"
        version: "%bundle_version%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        scripts: "0755"
        root: "0755"
        root/private: "0755"
        root/private/tmp: "0777"
      pkgroot: "%RECIPE_CACHE_DIR%/universal"

  - Processor: FileMover
    Arguments:
      overwrite: false
      source: "%RECIPE_CACHE_DIR%/%RECIPE_APP_NAME%_%INTEL_ARCH%-%bundle_version%.pkg"
      target: "%RECIPE_CACHE_DIR%/universal/root/private/tmp/%RECIPE_APP_NAME%_%INTEL_ARCH%-%bundle_version%.pkg"

  - Processor: FileMover
    Arguments:
      overwrite: false
      source: "%RECIPE_CACHE_DIR%/%RECIPE_APP_NAME%_%SILICON_ARCH%-%bundle_version%.pkg"
      target: "%RECIPE_CACHE_DIR%/universal/root/private/tmp/%RECIPE_APP_NAME%_%SILICON_ARCH%-%bundle_version%.pkg"

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/universal/scripts/postinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/zsh

        # Set variables
        declare -r INTEL="$3/private/tmp/%RECIPE_APP_NAME%_%INTEL_ARCH%-%bundle_version%.pkg"
        declare -r SILICON="$3/private/tmp/%RECIPE_APP_NAME%_%SILICON_ARCH%-%bundle_version%.pkg"

        # Determine architecture
        ARCH=$(/usr/bin/arch)

        # Install corresponding package
        if [[ "${ARCH}" == i386 ]]
        then
            /usr/sbin/installer -pkg "${INTEL}" -target "$3"
            EXIT_CODE=$?
        else
            /usr/sbin/installer -pkg "${SILICON}" -target "$3"
            EXIT_CODE=$?
        fi

        echo "Cleaning up..."
        /bin/rm -rf "${INTEL}" "${SILICON}"

        # Check exit code and bail if the package didn't install correctly
        if [[ "${EXIT_CODE}" -ne 0 ]]
        then
            echo "Something went wrong during package installation. Please check install.log and try again. Bailing..."
            exit 1
        fi

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: "%bundle_identifier%.Universal"
        options: purge_ds_store
        pkgname: "%RECIPE_APP_NAME%_Universal-%bundle_version%"
        pkgroot: "%RECIPE_CACHE_DIR%/universal/root"
        scripts: "%RECIPE_CACHE_DIR%/universal/scripts"
        version: "%bundle_version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%INTEL_ARCH%"
        - "%RECIPE_CACHE_DIR%/%SILICON_ARCH%"
        - "%RECIPE_CACHE_DIR%/universal"