<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
   <key>Description</key>
	<string>Downloads latest version of DaVinci Resolve 12 Studio
	Duplicated from Time Sutton's DaVinci Resolve 12 recipe
	
This product requires registration in order to download, so
you _must_ override all input variables beginning with 'REG_'
and they must contain data.</string>
	<key>Identifier</key>
	<string>com.github.amsysuk.amsys-recipes.DaVinciResolve12</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DaVinciResolve12</string>
		<key>PRODUCT_NAME_PATTERN</key>
		<string>^DaVinci Resolve (?P&lt;version&gt;12(\.\d+)*) Studio( Update)*$</string>
		<key>REG_CITY</key>
		<string></string>
		<key>REG_EMAIL</key>
		<string></string>
		<key>REG_FIRSTNAME</key>
		<string></string>
		<key>REG_LASTNAME</key>
		<string></string>
		<key>REG_PHONE</key>
		<string></string>
		<key>REG_STATE</key>
		<string></string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.timsutton.download.davinciresolve12</string>
</dict>
</plist>
