<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.amsysuk.amsys-recipes.pkg.Fusion8</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fusion</string>
		<key>PRODUCT_NAME_PATTERN</key>
		<string>^Fusion (?P&lt;version&gt;8(\.\d+)*)( Update)*$</string>
		<key>REG_CITY</key>
		<string></string>
		<key>REG_EMAIL</key>
		<string></string>
		<key>REG_FIRSTNAME</key>
		<string></string>
		<key>REG_LASTNAME</key>
		<string></string>
		<key>REG_PHONE</key>
		<string></string>
		<key>REG_STATE</key>
		<string></string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.timsutton.download.fusion8</string>
	<key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
		<key>Processor</key>
		<string>Copier</string>
		<key>Arguments</key>
		<dict>
			<key>source_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/Blackmagic_Fusion_%version%.dmg/Install Fusion v%version%.pkg</string>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			<key>purge_destination</key>
			<true/>
		</dict>
	</dict>
	</array>
</dict>
</plist>
