<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.pkg.Fusion8MMU</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fusion</string>
		<key>PRODUCT_NAME_PATTERN</key>
		<string>^Fusion (?P&lt;version&gt;8(\.\d+)*)( Update)*$</string>
		<key>REG_CITY</key>
		<string>Manchester</string>
		<key>REG_EMAIL</key>
		<string>noreply@mmu.ac.uk</string>
		<key>REG_FIRSTNAME</key>
		<string>Manchester</string>
		<key>REG_LASTNAME</key>
		<string>Met</string>
		<key>REG_PHONE</key>
		<string>01612474646</string>
		<key>REG_STATE</key>
		<string>Manchester</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.timsutton.download.fusion8</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>BlackMagicURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>c26039ca5cfbede1ba543fb29263447c1c23bb69</string>
				<key>path</key>
				<string>/Users/aadmin/Library/AutoPkg/RecipeRepos/com.github.autopkg.timsutton-recipes/Blackmagic/BlackMagicURLProvider.py</string>
				<key>sha256_hash</key>
				<string>85356dc78ce20a15f2e1fab763b637b70fa0e98c1f3794b66e3d7b2f5556fa69</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.timsutton.download.fusion8</key>
			<dict>
				<key>git_hash</key>
				<string>115f33b46aec650e93353ee6ad2d575cbe0e3cef</string>
				<key>path</key>
				<string>/Users/aadmin/Library/AutoPkg/RecipeRepos/com.github.autopkg.timsutton-recipes/Blackmagic/Fusion8.download.recipe</string>
				<key>sha256_hash</key>
				<string>4db924103dd195da497800719e3f78aeaaee642883bb70c18413e136104d2623</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
		<key>Processor</key>
		<string>Copier</string>
		<key>Arguments</key>
		<dict>
			<key>source_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/Blackmagic_Fusion_%version%.dmg/Install Fusion v%version%.pkg</string>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			<key>purge_destination</key>
			<true/>
		</dict>
	</dict>
	</array>
</dict>
</plist>
