<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.pkg.Fusion9</string>
    <key>Description</key>
    <string>Downloads and packages the latest version of Fusion 9.
    This product requires registration in order to download, so
you _must_ override all input variables beginning with 'REG_'
and they must contain data.

Notably, REG_STATE and REG_COUNTRY must contain sane values:
- REG_COUNTRY is of the form 'us', 'ca', etc.
- REG_STATE is a proper name, i.e. 'Maryland'.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Fusion</string>
        <key>PRODUCT_NAME_PATTERN</key>
        <string>^Fusion (?P&lt;version&gt;9(\.\d+)*)( Update)*$</string>
        <key>REG_CITY</key>
        <string></string>
        <key>REG_COUNTRY</key>
        <string></string>
        <key>REG_EMAIL</key>
        <string></string>
        <key>REG_FIRSTNAME</key>
        <string></string>
        <key>REG_LASTNAME</key>
        <string></string>
        <key>REG_PHONE</key>
        <string></string>
        <key>REG_STATE</key>
        <string></string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.timsutton.download.fusion8</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
             <key>Arguments</key>
             <dict>
                 <key>input_path</key>
                 <string>%RECIPE_CACHE_DIR%/%NAME%/Blackmagic_Fusion_%version%.dmg/Install Fusion v%version%.pkg</string>
                 <key>expected_authority_names</key>
                 <array>
                     <string>Developer ID Installer: Blackmagic Design Inc (9ZGFBWLSYP)</string>
                     <string>Developer ID Certification Authority</string>
                     <string>Apple Root CA</string>
                 </array>
             </dict>
             <key>Processor</key>
             <string>CodeSignatureVerifier</string>
	    </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Blackmagic_Fusion_%version%.dmg/Install Fusion v%version%.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
