<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Cubase 9.</string>
    <key>Identifier</key>
    <string>com.github.amsysuk.pkg.ad</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Cubase9</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.fosshub.com/Audacity.html/audacity-macos-2.1.3.dmg</string>
                <key>re_pattern</key>
                <string>https://www.fosshub.com/Audacity.html/audacity-macos-/+[0-9]+\.+[0-9]+\.+[0-9].dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>    
