<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string></string>
        <key>ADDITIONAL_COMPONENT</key>
        <string></string>
	</dict>
	<key>Description</key>
	<string>Downloads the latest version of Unity unity assets. Note, this
    recipe is designed to be used with an override, pointing to any of the
    additional unity components listed here:

    https://unity3d.com/unity/whats-new

    The "%ADDITIONAL_COMPONENT%" variable supports one of the following:

    Android
    AppleTV
    Facebook-Games
    iOS
    Linux
    Lumin
    Mac-IL2CPP
    WebGL
    Windows-Mono
    </string>
	<key>Identifier</key>
	<string>com.github.moofit-recipes.download.UnityAdditionalComponents</string>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://unity3d.com/unity/whats-new</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https:\/\/download\.unity3d\.com\/download_unity\/.*\/MacEditorTargetInstaller\/UnitySetup-%ADDITIONAL_COMPONENT%-Support-for-Editor-.*\.pkg)</string>
            </dict>
        </dict>
    	<dict>
    		<key>Processor</key>
    		<string>URLDownloader</string>
    		<key>Arguments</key>
    		<dict>
    			<key>url</key>
    			<string>%url%</string>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>EndOfCheckPhase</string>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Unity Technologies ApS (BVPN9UFA9B)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
