<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent download recipe to download the latest Google Chrome installer package.</string>
	<key>Identifier</key>
	<string>com.github.amsysuk.amsys-recipes.pkg.GoogleChrome</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>Google Chrome</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.googlechrome</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.amsysuk.amsys-recipes.Processors/Rsync</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>destination_path</key>
                <string>/Users/Shared/Packaging/Live</string>
                <key>rsync_arguments</key>
                <string>-a</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
