<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.download.ShutterEncoder

To Download the Intel version use "Mac 64bits" in the DOWNLOAD_TYPE variable
To Download the Apple Silicon version use "Apple Silicon" in the DOWNLOAD_TYPE variable</string>
    <key>Description</key>
    <string>Downloads the latest version of Shutter Encoder</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Shutter Encoder</string>
        <key>DOWNLOAD_PAGE_URL</key>
        <string>https://www.shutterencoder.com</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15'</string>
        <key>DOWNLOAD_TYPE</key>
        <string>Mac 64bits</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_PAGE_URL%</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>re_pattern</key>
                <string>Shutter Encoder .* %DOWNLOAD_TYPE%.pkg</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
            <key>Arguments</key>
            <dict>
                <key>find</key>
                <string> </string>
                <key>input_string</key>
                <string>%url%</string>
                <key>replace</key>
                <string>%20</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_PAGE_URL%/%output_string%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
