Identifier: com.github.moofit-recipes.download.SpotifyUniversal
Input:
  AMD64_URL: https://download.scdn.co/Spotify.dmg
  ARM64_URL: https://download.scdn.co/SpotifyARM64.dmg
  BUNDLE_ID: com.spotify.client
  NAME: Spotify
Process:

  - Processor: URLDownloader
    Arguments:
      url:   "%AMD64_URL%"
      filename: "%NAME%-amd64.dmg"

  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Spotify.app"
      requirement: identifier "com.spotify.client" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2FNC3A47ZF"
      
  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Spotify.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: URLDownloader
    Arguments:
      url:   "%ARM64_URL%"
      filename: "%NAME%-arm64.dmg"

  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Spotify.app"
      requirement: identifier "com.spotify.client" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2FNC3A47ZF"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Spotify.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString