Description: Downloads both Intel and Silicon versions of FileZilla and builds them into a universal installer
Identifier: com.github.moofit-recipes.pkg.FileZilla-Universal
Input:
  NAME: FileZilla
  URL: https://filezilla-project.org/download.php?show_all=1
  INTEL_ARCH: x86
  SILICON_ARCH: arm64

ParentRecipe: com.github.moofit-recipes.download.FileZilla-Universal
Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%INTEL_ARCH%"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/Extract/%INTEL_ARCH%/%NAME%.app"

  - Processor: Copier
    Arguments:
      source_path: "%found_filename%"
      destination_path: "%pkgroot%/Applications/%NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundle_id%.%INTEL_ARCH%"
        pkgname: "%NAME%_%INTEL_ARCH%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/%INTEL_ARCH%"
        version: "%version%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%SILICON_ARCH%"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/Extract/%SILICON_ARCH%/%NAME%.app"

  - Processor: Copier
    Arguments:
      source_path: "%found_filename%"
      destination_path: "%pkgroot%/Applications/%NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundle_id%.%SILICON_ARCH%"
        pkgname: "%NAME%_%SILICON_ARCH%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/%SILICON_ARCH%"
        version: "%version%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        scripts: "0755"
        root: "0755"
        root/private: "0755"
        root/private/tmp: "0777"
      pkgroot: "%RECIPE_CACHE_DIR%/Universal"

  - Processor: FileMover
    Arguments:
      overwrite: false
      source: "%RECIPE_CACHE_DIR%/%NAME%_%INTEL_ARCH%-%version%.pkg"
      target: "%RECIPE_CACHE_DIR%/universal/root/private/tmp/%NAME%_%INTEL_ARCH%-%version%.pkg"

  - Processor: FileMover
    Arguments:
      overwrite: false
      source: "%RECIPE_CACHE_DIR%/%NAME%_%SILICON_ARCH%-%version%.pkg"
      target: "%RECIPE_CACHE_DIR%/universal/root/private/tmp/%NAME%_%SILICON_ARCH%-%version%.pkg"

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/Universal/scripts/postinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/zsh

        # Set variables
        declare -r INTEL="$3/private/tmp/%NAME%_%INTEL_ARCH%-%version%.pkg"
        declare -r APPLE_SILICON="$3/private/tmp/%NAME%_%SILICON_ARCH%-%version%.pkg"

        # Determine architecture
        ARCH=$(/usr/bin/arch)

        # Install corresponding package
        if [[ "${ARCH}" == i386 ]]
        then
            /usr/sbin/installer -pkg "${INTEL}" -target "$3"
            EXIT_CODE=$?
        else
            /usr/sbin/installer -pkg "${APPLE_SILICON}" -target "$3"
            EXIT_CODE=$?
        fi

        echo "Cleaning up..."
        /bin/rm -rf "${INTEL}" "${APPLE_SILICON}"

        # Check exit code and bail if the package didn't install correctly
        if [[ "${EXIT_CODE}" -ne 0 ]]
        then
            echo "Something went wrong during package installation. Please check install.log and try again. Bailing..."
            exit 1
        fi

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: "%bundle_id%"
        pkgname: "%app_name%_Universal-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/Universal/root"
        scripts: "%RECIPE_CACHE_DIR%/Universal/scripts"
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Universal"
        - "%RECIPE_CACHE_DIR%/%INTEL_ARCH%"
        - "%RECIPE_CACHE_DIR%/%SILICON_ARCH%"
        - "%RECIPE_CACHE_DIR%/Downloads"
        - "%RECIPE_CACHE_DIR%/Extract"