<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.amsysuk.amsys-recipes.pkg.XcodeEduLab</string>
    <key>Description</key>
    <string>Creates an installer package from a supplied .xip file downloaded
from https://developer.apple.com/download/. The xip file needs to be copied to
/Path/To/AutoPkg/RecipeRepos/com.github.amsysuk/Xcode/xip. Will also add a
postflight script to install the command-line tools and configure these for
education lab use.

Due to Apple signed packages not being able to install to SIP protected areas
when called via a postflight, the additional packages are installed by a
self-destrictible LaunchDaemon which is called immediately after the "parent"
Xcode installer is complete. This LaunchDaemon runs a script (both stored in
/tmp) which installs all 3 additional component packages, and then unloads and
deletes the launchdaemon, and itself.
    </string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Xcode</string>
        <key>XIPNAME</key>
        <string>Xcode*.xip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>XcodeXIPUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>PKG</key>
                <string>%RECIPE_DIR%/XIP/%XIPNAME%</string>
            </dict>
            <key>Comment</key>
            <string>Borrowed from Facebook's Xcode recipe https://github.com/facebook/Recipes-for-AutoPkg/tree/master/Xcode</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%output_app%/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                    <key>private</key>
                    <string>0755</string>
                    <key>private/tmp</key>
                    <string>0777</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/Xcode_unpack/%NAME%.app</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_DIR%/additional/uk.co.amsys.Xcode.components.plist</string>
                <key>destination_path</key>
                <string>%pkgroot%/private/tmp/uk.co.amsys.Xcode.components.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_DIR%/additional/componentsInstaller.sh</string>
                <key>destination_path</key>
                <string>%pkgroot%/private/tmp/componentsInstaller.sh</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>mode</key>
                            <string>0775</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>private</string>
                            <key>user</key>
                            <string>root</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>private/tmp</string>
                            <key>user</key>
                            <string>root</string>
                            <key>mode</key>
                            <string>0777</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>private/tmp/componentsInstaller.sh</string>
                            <key>user</key>
                            <string>root</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>private/tmp/uk.co.amsys.Xcode.components.plist</string>
                            <key>user</key>
                            <string>root</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>scripts</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                </dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
