<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates an installer package from a supplied .xip file downloaded from https://developer.apple.com with the '-p' flag.
    e.g. `autopkg run XcodeEduLab.pkg -p /path/to/download/Xcode8.3.3.xip`
    Will also add a postflight script to install the command-line tools and configure these for education lab use</string>
    <key>Identifier</key>
    <string>com.github.amsysuk.amsys-recipes.pkg.XcodeEduLab</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Xcode</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <!--
        <dict>
            <key>Processor</key>
            <string>PackageRequired</string>
        </dict>
        -->
        <dict>
            <key>Processor</key>
            <string>XcodeXIPUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>PKG</key>
                <string>%RECIPE_CACHE_DIR%/XIP/*.xip</string>
            </dict>
            <key>Comment</key>
            <string>Borrowed from Facebook's Xcode recipehttps://github.com/facebook/Recipes-for-AutoPkg/tree/master/Xcode</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%output_app%/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/Xcode_unpack/%NAME%.app</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                    </array>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                </dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
