<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.amsysuk-recipes.pkg.XcodeEduLab</string>
    <key>Description</key>
    <string>Creates an installer package from a supplied .xip file downloaded
from https://developer.apple.com/download/. The xip file needs to be copied to
the same folder that the recipe is running from ("/path/to/amsys-recipes", or
"/path/to/overrides_folder" if using an override.). Will also add a
postflight script to install the command-line tools and configure these for
education lab use.

The %XIPNAME% variable should contain the name of the Xcode xip file; this also
enables the use of multiple overrides, if multiple xips are used (i.e if
different versions of Xcode are required).

Due to Apple signed packages not being able to install to SIP protected areas
when called via a postflight, the additional packages are installed by a
self-destrictible LaunchDaemon which is called immediately after the "parent"
Xcode installer is complete. This LaunchDaemon runs a script (both stored in
/tmp) which installs all 3 additional component packages, and then unloads and
deletes the launchdaemon, and itself.
    </string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Xcode</string>
        <key>XIPNAME</key>
        <string></string>
        <key>SCRIPTS</key>
        <string>scripts</string>
        <key>ADDITIONALS</key>
        <string>additionals</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>XcodeXIPUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>PKG</key>
                <string>%RECIPE_DIR%/%XIPNAME%</string>
            </dict>
            <key>Comment</key>
            <string>Borrowed from Facebook's Xcode recipe https://github.com/facebook/Recipes-for-AutoPkg/tree/master/Xcode</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                    <key>private</key>
                    <string>0755</string>
                    <key>private/tmp</key>
                    <string>0777</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/Xcode_unpack/%NAME%.app</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Comment</key>
            <string>Make postinstall script to install the additional packages</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%pkgroot%/tmp/xcodeComponentsInstaller.sh</string>
                <key>file_content</key>
                <string>#!/bin/bash

# Install Xcode components from Xcode.app
/usr/sbin/installer -pkg /Applications/Xcode.app/Contents/Resources/Packages/MobileDevice.pkg -target / -verbose
/usr/sbin/installer -pkg /Applications/Xcode.app/Contents/Resources/Packages/MobileDeviceDevelopment.pkg -target / -verbose
/usr/sbin/installer -pkg /Applications/Xcode.app/Contents/Resources/Packages/XcodeSystemResources.pkg -target / -verbose

# Stop and remove LaunchDaemon and script
/bin/launchctl stop uk.co.moof-it.xcodeComponentsInstaller.plist
/bin/launchctl remove uk.co.moof-it.xcodeComponentsInstaller.plist
rm /tmp/uk.co.moof-it.xcodeComponentsInstaller.plist
rm /tmp/xcodeComponentsInstaller.sh</string>
                <key>file_mode</key>
                <string>0755</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Make launchd plist for the above script at /tmp</string>
            <key>Processor</key>
            <string>PlistEditor</string>
            <key>Arguments</key>
            <dict>
                <key>output_plist_path</key>
                <string>%pkgroot%/tmp/uk.co.moof-it.xcodeComponentsInstaller.plist</string>
                <key>plist_data</key>
                <dict>
                    <key>Label</key>
                    <string>uk.co.moof-it.xcodeComponentsInstaller</string>
                    <key>ProgramArguments</key>
                    <array>
                            <string>/tmp/xcodeComponentsInstaller.sh</string>
                    </array>
                    <key>RunAtLoad</key>
                    <true/>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>mode</key>
                            <string>0775</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>tmp</string>
                            <key>user</key>
                            <string>root</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>tmp/uk.co.moof-it.Xcode.components.plist</string>
                            <key>user</key>
                            <string>root</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>%SCRIPTS%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                </dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
