Description: Downloads and Packages Adobe Acrobat Pro
Identifier: com.github.moofit-recipes.pkg.AdobeAcrobatPro
Input:
  NAME: Adobe Acrobat Pro
  URL: https://trials.adobe.com/AdobeProducts/APRO/Acrobat_HelpX/osx10/Acrobat_DC_Web_WWMUI.dmg

MinimumVersion: '1.0.0'
ParentRecipe: com.github.moofit-recipes.download.AdobeAcrobatPro
Process:
  
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%/%dmg_found_filename%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
  
  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/application.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/unpack/pkgroot/Applications"
  
  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/unpack/pkgroot/Applications/Adobe Acrobat.app/Contents/Info.plist"
      plist_version_key: CFBundleVersion

  - Processor: EndOfCheckPhase

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%/%dmg_found_filename%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"