<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ClickShare client.</string>
	<key>Identifier</key>
	<string>com.github.moofit-recipes.download.ClickShare</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ClickShare</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fail_deleter_silently</key>
				<true/>
				<key>path_list</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>com.github.smithjw.processors/FriendlyPathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"downloadUrl":\"(https://.+)",</string>
				<key>result_output_var_name</key>
				<string>match</string>
				<key>curl_opts</key>
				 <array>
					 <string>-b ClickShare.txt -L</string>
				 </array>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
					<key>Accept</key>
					<string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
					<key>Sec-Fetch-Site</key>
					<string>none</string>
					<key>Sec-Fetch-Dest</key>
					<string>document</string>
					<key>Accept-Language</key>
					<string>en-GB,en;q=0.9</string>
					<key>Priority</key>
					<string>u=0, i</string>
					<key>Accept-Encoding</key>
					<string>gzip, deflate, br</string>
					<key>Sec-Fetch-Mode</key>
					<string>navigate</string>
				</dict>
				<key>url</key>
				<string>https://www.barco.com/bin/barco/tde/downloadUrl.json?fileNumber=R3306192&amp;tdeType=3</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*.dmg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%found_filename%/ClickShare.app</string>
				<key>requirement</key>
				<string>identifier "com.barco.clickshare.updater" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = P6CDJZR997</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
