<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ClickShare client.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.download.ClickShare</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ClickShare</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.smithjw.processors/FriendlyPathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>fail_deleter_silently</key>
                <true/>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
                    <string>%RECIPE_CACHE_DIR%/downloads/downloadUrl.json</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>downloadUrl.json</string>
                <key>url</key>
                <string>https://www.barco.com/bin/barco/tde/downloadUrl.json?fileNumber=R3306192&amp;tdeType=3</string>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.dataJAR-recipes.Shared Processors/JSONFileReader</string>
            <key>Arguments</key>
            <dict>
                <key>json_key</key>
                <string>downloadUrl</string>
                <key>json_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/downloadUrl.json</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%json_value%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*/*.dmg</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%/ClickShare.app</string>
                <key>requirement</key>
                <string>identifier "com.barco.clickshare.updater" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = P6CDJZR997</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
