<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest MirrorOp Mac Sender and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.pkg.MirrorOp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MirrorOp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.download.MirrorOp</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/MirrorOp.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
