<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest MirrorOp Mac Sender.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.download.MirrorOp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MirrorOp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.smithjw.processors/FriendlyPathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>fail_deleter_silently</key>
                <true/>
                <key>path_list</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <!-- <key>request_headers</key>
                <dict>
                    <key>Referer</key>
                    <string>https://www.barco.com/gb-en/support/mirrorop/drivers;auto</string>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.4 Safari/605.1.15</string>
                    <key>Host</key>
                    <string>www.barco.com</string>
                    <key>Accept</key>
                    <string>*/*</string>
                    <key>Sec-Fetch-Site</key>
                    <string>same-origin</string>
                    <key>Sec-Fetch-Dest</key>
                    <string>empty</string>
                    <key>Accept-Language</key>
                    <string>en-GB,en;q=0.9</string>
                    <key>Sec-Fetch-Mode</key>
                    <string>cors</string>
                    <key>Accept-Encoding</key>
                    <string>gzip, deflate, br</string>
                    <key>Connection</key>
                    <string>keep-alive</string>
                </dict> -->
                <key>re_pattern</key>
                <string>downloadUrl\":\"(.*)\",</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>url</key>
                <string>https://www.barco.com/bin/barco/tde/downloadUrl.json?fileNumber=R33050100&amp;tdeType=3</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <!-- <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.4 Safari/605.1.15</string>
                </dict> -->
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/MirrorOp.app</string>
                <key>requirement</key>
                <string>identifier "com.MirrorOp.Vitali" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UWHQ4AWKZ8</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
