Identifier: com.github.moofit-recipes.download.ProtonVPN
Description: Recipe to download Protonvpn
Input:
  RECIPE_NAME: ProtonVPN
Process:
  
  - Processor: URLDownloader
    Arguments:
      url: "https://protonvpn.com/download/ProtonVPN.dmg"
      filename: "%RECIPE_NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/%RECIPE_NAME%.app"
      requirement: anchor apple generic and identifier "ch.protonvpn.mac" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6S6Q257EK)

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/%RECIPE_NAME%.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundleid
        CFBundleName: real_app_name
