<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads a specific version of DEPNotify, as determined by the
    input field below, and adds in additional resources to allow for
    customisation</string>
    <key>Identifier</key>
    <string>com.github.moof-it-recipes.pkg.DEPNotify</string>
    <key>Input</key>
    <dict>
        <key>BUNDLE_ID</key>
        <string>menu.nomad.DEPNotify</string>
        <key>NAME</key>
        <string>DEPNotify</string>
        <key>VERSION</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.moof-it-recipes.download.DEPNotify</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_to_create</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Application Support/DEPNotify</string>
            </dict>
            <key>Processor</key>
            <string>com.github.amsysuk-recipes.Processors/PathCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_to_create</key>
                <string>%RECIPE_CACHE_DIR%/scripts</string>
            </dict>
            <key>Processor</key>
            <string>com.github.amsysuk-recipes.Processors/PathCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Comment</key>
            <string>Create postinstall</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
                <key>file_content</key>
                <string>#!/bin/bash

# Setup Path to Plist file
/usr/bin/defaults write menu.nomad.DEPNotify PathToPlistFile "/Library/Application Support/DEPNotify/"</string>
                <key>file_mode</key>
                <string>0755</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>Applications/Utilities</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>wheel</string>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>Library/Application Support</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>path</key>
                            <string>Library/Application Support/DEPNotify</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                    </array>
                    <key>id</key>
                    <string>%BUNDLE_ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>scripts</key>
                    <string>%RECIPE_CACHE_DIR%/scripts</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
