<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>com.github.moof-it-recipes.pkg.NoMADLaunchAgent</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
		<string>NoMAD LaunchAgent</string>
        <key>DOWNLOAD_URL</key>
        <string>http://orchardgrove.wpengine.com/download/NoMAD-LaunchAgent.pkg</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Joel Rennich (AAPZK3CB24)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        <key>Processor</key>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%input_path%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-1.0.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
