<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest custom TeamViewer QuickSupport zip. The
    ORG_NAME variable should exactly reflect the TV organisation name. Outputs
    a pkg installer.</string>
	<key>Identifier</key>
	<string>com.github.moofit-recipes.pkg.TeamViewerQSCustom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewerQS</string>
        <key>ORG_NAME</key>
		<string></string>
		<key>DOWNLOAD_URL</key>
		<string>https://customdesign.teamviewer.com/download/version_13x/%ORG_NAME%/TeamViewerQS.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
    <key>ParentRecipe</key>
    <string>com.github.moofit-recipes.download.TeamViewerQSCustom</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/unzipped/TeamViewerQS.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/TeamViewerQS.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pkgroot%/Applications/TeamViewerQS.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
