<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of OneDrive Standalone installer pkg from Microsoft and exposes the pkg itself</string>
        <key>Identifier</key>
        <string>com.github.amsysuk.amsys-recipes.pkg.MSOneDrive</string>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>ParentRecipe</key>
        <string>com.github.apettinen.download.MSOneDrive</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>OneDrive</string>
            <key>URL</key>
            <string>https://go.microsoft.com/fwlink/?linkid=823060</string>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/expanded</string>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/expanded/%filename%/Payload</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Applications/DaVinci Resolve/DaVinci Resolve.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                    <key>source_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Resolve.pkg</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
