<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.moofit-recipes.pkg.Powershell</string>
	<key>Description</key>
	<string>Uses parent download recipe to download the latest Powershell
    installer package using the parent recipe
    com.github.autopkg.download.MSAutoUpdate. This override renames the package
	to "PowerShell-$version"
	</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>PowerShell</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.vmiller.download.PowerShell</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
