<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.amsysuk-recipes.pkg.VisualStudioCode</string>
    <key>Description</key>
    <string>Downloads latest Visual Studio Code zip using the parent recipe
    com.github.valdore86.download.visualstudiocode and builds a package.
    </string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Visual Studio Code</string>
        <key>DOWNLOAD_ARCH</key>
        <string>universal</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.jc0b.download.VisualStudioCode</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>force_pkg_build</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
