<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.amsysuk-recipes.pkg.Blender</string>
    <key>Description</key>
    <string>Downloads the current release version of Blender and builds a
package.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Blender</string>
    </dict>
    <key>ParentRecipe</key>
    <string>io.github.hjuutilainen.download.Blender</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/blender-*</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pkgroot%/Applications/Blender/blender.app</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                    <key>CFBundleName</key>
                    <string>app_name</string>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
