Description: Downloads QLab5
Identifier: com.github.moofit-recipes.download.Qlab5
Input:
  NAME: QLab5

Based on: com.github.dataJAR-recipes.download.QLab5

MinimumVersion: '2.3'
Process:

  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: "https://figure53.com/qlab/downloads/appcast-v5"

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Applications"
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%/Applications/QLab.app"
      requirement: anchor apple generic and identifier "com.figure53.QLab.5" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7672N4CCJM")