<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest VSD Viewer disk image.</string>
    <key>Identifier</key>
    <string>com.github.moofit-recipes.download.VSDViewer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VSD Viewer</string>
        <key>DOWNLOAD_URL</key>
        <string>https://nektony.com/download/vsdviewer.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/*.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%dmg_found_filename%</string>
                <key>strict_verification</key>
                <false/>
                <key>requirement</key>
                <string>identifier "com.nektony.vsdviewers" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3BU773L7ZF"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
