Identifier: com.github.moofit-recipes.download.MiroUniversal
Input:
  AMD64_URL: https://desktop.miro.com/platforms/darwin/Install-Miro.dmg
  ARM64_URL: https://desktop.miro.com/platforms/darwin-arm64/Install-Miro.dmg
  BUNDLE_ID: com.electron.realtimeboard
  NAME: Miro
Process:

  - Processor: URLDownloader
    Arguments:
      url:   "%AMD64_URL%"
      filename: "%NAME%-amd64.dmg"

  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Miro.app"
      requirement: identifier "com.electron.realtimeboard" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M3GM7MFY7U
      
  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Miro.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: URLDownloader
    Arguments:
      url:   "%ARM64_URL%"
      filename: "%NAME%-arm64.dmg"

  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Miro.app"
      requirement: identifier "com.electron.realtimeboard" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M3GM7MFY7U

  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Miro.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString