Description: Recipe description
Identifier: com.github.moofit-recipes.download.Viber
Input:
  NAME: Viber
  URL: https://www.viber.com/en/download/

MinimumVersion: '2.3'
Process:

  - Processor: URLTextSearcher
    Arguments:
      url: "%URL%"
      re_pattern: "https://download.cdn.viber.com/desktop/mac/Viber.dmg"

  - Processor: URLDownloader
    Arguments:
      url: "https://download.cdn.viber.com/desktop/mac/Viber.dmg"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/%NAME%.app"
      requirement: anchor apple generic and identifier "com.viber.osx" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "86ZW9CB9ZQ")

  - Processor: EndOfCheckPhase

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/%NAME%.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundleid