<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest CtrlPrint Transfer Manager disk image.</string>
    <key>Identifier</key>
    <string>CtrlPrintTransferManager.download.recipe</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CtrlPrint Transfer Manager</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.ctrlprint.net/apps/transfermanager/CtrlPrintTransferManager.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/CtrlPrint Transfer Manager.app</string>
                <key>requirement</key>
                <string>identifier "net.ctrlprint.CtrlPrintTransferManager" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7NK675MB7H"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
