Identifier: com.github.moofit-recipes.download.8x8WorkUniversal
Description: Downloads both Intel and Silicon versions of 8x8 to be packaged into a universal installer
Input:
  INTEL: x86
  SILICON: arm64
Process:

  - Processor: URLTextSearcher
    Description: find the url for the Intel installer and store it as the intel_url variable
    Arguments:
      url: "https://support.8x8.com/cloud-phone-service/voice/work-desktop/download-8x8-work-for-desktop"
      re_pattern: href="(https://vod-updates.8x8.com/ga/work-dmg-v[0-9].*\.dmg)"
      result_output_var_name: intel_url

  - Processor: URLDownloader
    Arguments:
      url: "%intel_url%"
      filename: "8x8 Work-%INTEL%.dmg"
      download_dir: "%RECIPE_CACHE_DIR%/Downloads"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/8x8 Work.app"
      requirement: identifier "com.electron.8x8---virtual-office" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FC967L3QRG

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/8x8 Work.app/Contents/Info.plist"
      plist_keys: 
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundle_id
        CFBundleName: app_name

  - Processor: EndOfCheckPhase

  - Processor: URLTextSearcher
    Description: find the url for the Silicon installer and store it as the silicon_url variable
    Arguments:
      url: "https://support.8x8.com/cloud-phone-service/voice/work-desktop/download-8x8-work-for-desktop"
      re_pattern: href="(https://vod-updates.8x8.com/ga/work-arm64-dmg-v[0-9].*\.dmg)"
      result_output_var_name: silicon_url

  - Processor: URLDownloader
    Arguments:
      url: "%silicon_url%"
      filename: "8x8 Work-%SILICON%.dmg"
      download_dir: "%RECIPE_CACHE_DIR%/Downloads"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/8x8 Work.app"
      requirement: identifier "com.electron.8x8---virtual-office" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FC967L3QRG

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/8x8 Work.app/Contents/Info.plist"
      plist_keys: 
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundle_id
        CFBundleName: app_name

  - Processor: EndOfCheckPhase