Description: Recipe description
Identifier: com.github.moofit-recipes.pkg.Telegram
Input:
  NAME: Telegram
  URL: https://telegram.org/dl/desktop/mac

MinimumVersion: '2.3'
ParentRecipe: com.github.moofit-recipes.download.Telegram
Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg"
  
  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      source_path: "%found_filename%/%NAME%.app"

  - Processor: com.github.homebysix.VersionSplitter/VersionSplitter
    Arguments:
      version: "%version%"
      split_on: _

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"
     