Identifier: com.github.moofit-recipes.download.GuardingBrowser
Input:
  AMD64_URL: https://production-archimedes-secure-browser-artifacts.s3.amazonaws.com/latest/mac-x64/guardian-browser-x64.dmg
  ARM64_URL: https://production-archimedes-secure-browser-artifacts.s3.amazonaws.com/latest/mac-arm64/guardian-browser-arm64.dmg
  BUNDLE_ID: com.proctoru.guardian-browser
  NAME: Guarding Browser
Process:

  - Processor: URLDownloader
    Arguments:
      url: "%AMD64_URL%"
      filename: "%NAME%-amd64.dmg"

  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Guardian Browser.app"
      requirement: identifier "com.proctoru.guardian-browser" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TCATJSU2Y"
      
  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Guardian Browser.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: URLDownloader
    Arguments:
      url: "%ARM64_URL%"
      filename: "%NAME%-arm64.dmg"

  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Guardian Browser.app"
      requirement: identifier "com.proctoru.guardian-browser" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TCATJSU2Y"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Guardian Browser.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString