Identifier: com.github.moofit-recipes.pkg.CatoClient
Description: Packages the latest Cato Client application
ParentRecipe: com.github.moofit-recipes.download.CatoClient
Input:
  RECIPE_APP_NAME: CatoClient
MinimumVersion: '1.0.0'
Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/Unpack/%RECIPE_APP_NAME%.app"
  
  - Processor: Copier
    Arguments:
      source_path: "%found_filename%"
      destination_path: "%pkgroot%/Applications/%RECIPE_APP_NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundle_id%"
        pkgname: "%real_app_name%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"